# CannotScaleLinkWithSharedCoordinates Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ScaleFailures..::..CannotScaleLinkWithSharedCoordinates Property
BuiltInFailures..::..ScaleFailures Class See Also
---
Can't scale link that shares coordinates with host model
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotScaleLinkWithSharedCoordinates { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotScaleLinkWithSharedCoordinates As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotScaleLinkWithSharedCoordinates {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ScaleFailures Class
Autodesk.Revit.DB Namespace